# Лабораторная работа. Настройка протокола OSPFv2 для одной области
## Задачи
Часть 1. Создание сети и настройка основных параметров устройства
Часть 2. Настройка и проверка базовой работы протокола  OSPFv2 для одной области
Часть 3. Оптимизация и проверка конфигурации OSPFv2 для одной области


  **Таблица адресации**   
  
| Устройство |Интерфейс    | IP-адрес     | Маска подсети  |
|------------|-------------|--------------|----------------|
|    R1      | G 0/0/1     | 10.53.0.1    |255.255.255.0   |
|            | Loopback1   | 172.16.1.1   |255.255.255.0   |
|    R2      | G 0/0/1     | 10.53.0.2    |255.255.255.0   |
|            | Loopback1   | 192.168.1.1  |255.255.255.0   |

## Ход выполнения работы    
### 1. Настройка основных параметров устройств  
Создадим топологию, согласно заданию ![](pic/network.png)   
Произведем базовую настройку маршрутизаторов и коммутаторов. Данные настройки можно увидеть в конфигурациях ниже. 

### 2. Настройка и проверка базовой работы протокола OSPFv2 для одной области 
***Настроим адреса интерфейса и базового OSPFv2 на каждом маршрутизаторе.*** 
**а)** Настроим адреса интерфейсов, согласно таблице адресации (на примере R1)
``` 
R1(config)#int g0/0/1 
R1(config-if)#ip address 10.53.0.1 255.255.255.0 
R1(config-if)#int loopback1 
R1(config-if)ip address 172.16.1.1 255.255.255.0 
``` 
**b)** Перейдем в режим конфигурации маршрутизатора OSPF, используя идентификатор процесса 56. 
**c)** Настроим статический идентификатор маршрутизатора для каждого маршрутизатора 
``` 
R1(config)#router ospf 56
R1(config-router)#router-id 1.1.1.1 
``` 
**d)** Настроим OSPF для сети между R1 и R2, поместив ее в область 0.  
```  
R1(config)#router ospf 56
R1(config-router)#network 10.53.0.0 0.0.0.255 area 0 
``` 
**e)** На R2 добавим конфигурацию, необходимую для объявления сети Loopback 1 в область OSPF 0. 
``` 
R2(config)#router ospf 56
R2(config-router)#network 192.168.1.0 0.0.0.255 area 0  
``` 
**f)** Убедимся, что ежду R1 и R2 сформировалась смежность 
``` 
R1#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/BDR        00:01:46    10.53.0.2       GigabitEthernet0/0/1
R1# 
``` 



